&НаКлиенте
Перем КонтекстЯдра;
&НаКлиенте
Перем Ожидаем;

&НаКлиенте
Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСписокТестов() Экспорт
	ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("ТестДолжен_ПроверитьДваПлюсДваРавноЧетыре_НаФорме");
	
	Возврат ВсеТесты;
КонецФункции

&НаКлиенте
Процедура ТестДолжен_ПроверитьДваПлюсДваРавноЧетыре_НаФорме() Экспорт
	Ожидаем.Что(2 + 2).Равно(4);
КонецПроцедуры
