Перем Ванесса;

Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;

	ВсеТесты = Новый Массив;

	// описание шагов
	//пример вызова Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯПрервалВыполнениеШаговВХостСистемеИЯНажалНаКнопку(Парам01Строка)","ЯПрервалВыполнениеШаговВХостСистемеИЯНажалНаКнопку","я прервал выполнение шагов в хост системе и я нажал на кнопку ""ВыполнитьСценарии""");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВТестируемомЭкземпляреВыполнилсяСценарий()","ВТестируемомЭкземпляреВыполнилсяСценарий","в тестируемом экземпляре выполнился сценарий");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯПродолжилВыполнениеШаговВХостСистеме()","ЯПродолжилВыполнениеШаговВХостСистеме","Я продолжил выполнение шагов в хост системе");

	Возврат ВсеТесты;
КонецФункции

Процедура ПередНачаломСценария() Экспорт
	//подложим специальную epf, как будто она уже была там
	ПутьКудаПоложитьEPF = Ванесса.КаталогИнструментов + "/features/Support/Templates/step_definitions/ПростаяФичаДляПроверкиРаботыВыполненияСценария.epf";
	ФайлПроверкаСуществования = Новый Файл(ПутьКудаПоложитьEPF);
	Контекст.Вставить("ПутьКудаПоложитьEPF",ПутьКудаПоложитьEPF);
	Если ФайлПроверкаСуществования.Существует() Тогда
		УдалитьФайлы(ПутьКудаПоложитьEPF);
	КонецЕсли;

	ФайлПуть = Новый Файл(ФайлПроверкаСуществования.Путь);
	Если Не ФайлПуть.Существует() Тогда
		СоздатьКаталог(ФайлПуть.ПолноеИмя);
	КонецЕсли;

	Макет = ПолучитьМакет("Макет");
	Макет.Записать(ПутьКудаПоложитьEPF);
КонецПроцедуры

Процедура ПередОкончаниемСценария() Экспорт
	УдалитьФайлы(Контекст.ПутьКудаПоложитьEPF);

	//безусловное закрытие формы если она осталась
	Попытка
	    ОткрытаяФормаVanessaADD = Контекст.ОткрытаяФормаVanessaADD;
		ОткрытаяФормаVanessaADD.Закрыть();
	Исключение

	КонецПопытки;
КонецПроцедуры

//я прервал выполнение шагов в хост системе и я нажал на кнопку "ВыполнитьСценарии"
//@ЯПрервалВыполнениеШаговВХостСистемеИЯНажалНаКнопку(Парам01Строка)
Процедура ЯПрервалВыполнениеШаговВХостСистемеИЯНажалНаКнопку(ИмяКнопки) Экспорт
	Ванесса.ЗапретитьВыполнениеШагов();

	ОткрытаяФормаVanessaADD = Контекст.ОткрытаяФормаVanessaADD;
	ОткрытаяФормаVanessaADD.ВыполнитьСценарии();

КонецПроцедуры

Процедура ПроверитьЧтоШагВыполнился(ДеревоСтроки,БылУспешныйШаг)
	Для каждого СтрокаДерева Из ДеревоСтроки Цикл
		Если СтрокаДерева.Тип = "Шаг" Тогда
			Если СтрокаДерева.Статус = "Success" Тогда
				БылУспешныйШаг = Истина;
			КонецЕсли;
		Иначе
			ПроверитьЧтоШагВыполнился(СтрокаДерева.Строки,БылУспешныйШаг);
		КонецЕсли;
	КонецЦикла;

	Ванесса.ПроверитьРавенство(БылУспешныйШаг,Истина,"Был хотя бы один успешный шаг.");
КонецПроцедуры

//в тестируемом экземпляре выполнился сценарий
//@ВТестируемомЭкземпляреВыполнилсяСценарий()
Процедура ВТестируемомЭкземпляреВыполнилсяСценарий() Экспорт
	//ОткрытаяФормаVanessaADD = Контекст.ОткрытаяФормаVanessaADD;

	//это ссылка на первый шаг
	БылУспешныйШаг = Ложь;
	ПроверитьЧтоШагВыполнился(Контекст.ОбработкаОбъектVanessaADD.ДеревоТестов.Строки,БылУспешныйШаг);
	//Ванесса.ПроверитьРавенство(Ванесса.ДеревоТестов.Строки[0].Строки[0].Строки[0].Строки[0].Статус,"Success","Шаг выполнился");
КонецПроцедуры

//Я продолжил выполнение шагов в хост системе
//@ЯПродолжилВыполнениеШаговВХостСистеме()
Процедура ЯПродолжилВыполнениеШаговВХостСистеме() Экспорт

КонецПроцедуры
