#Область ПрограммныйИнтерфейс

#Область СоздателиТестовыхДанных

// Задать параметры по умолчанию для создания метаданного
// 	Можно добавлять доп.структуру ОбменДанными с Загрузка = Истина
//
// Параметры:
//  ДопПараметры - Неопределено, Структура	 - доп.параметры для установки
// 
// Возвращаемое значение:
//   Структура - ключ - имя реквизита метаданного, значение - его значения
//
Функция Тест_Параметры(Знач ДопПараметры = Неопределено) Экспорт
    
    Р = Новый Структура ();
	
	Р.Вставить("Дата", ТекущаяДатаСеанса());
	Р.Вставить("Проведен", Истина);
	Р.Вставить("ПометкаУдаления", Ложь);
	
	Р.Вставить("ТабЧасть", Новый Массив);
	
	Р.Вставить("РеквизитПростойСправочник", Справочники.ПростойСправочник.ПредопределенноеЗначение1);
	//Р.Вставить("РеквизитПростойСправочник", Справочники.ПростойСправочник2.);
	
	Возврат Тест_СозданиеДанных.ДополнитьПараметры(Р, ДопПараметры);
	
КонецФункции

// Задать параметры по умолчанию для создания табличной части метаданного
// 	Можно добавлять доп.структуру ОбменДанными с Загрузка = Истина
//
// Параметры:
//  ДопПараметры - Неопределено, Структура	 - доп.параметры для установки
// 
// Возвращаемое значение:
//   Структура - ключ - имя реквизита метаданного, значение - его значения
//
Функция Тест_ПараметрыТабЧасти(Знач ДопПараметры = Неопределено) Экспорт
    
	Р = Новый Структура ();
	
	Р.Вставить("Реквизит1", "ТестСтрока1");
	Р.Вставить("РесурсЧисло", 21);
	Р.Вставить("РесурсЧисло1", 11);
	
	Возврат Тест_СозданиеДанных.ДополнитьПараметры(Р, ДопПараметры);
	
КонецФункции

// Создать нужный элемент, документ, набор записей и т.п.
//
// Параметры:
//  Параметры	 - Структура	 - 
// 		Может быть вложенная структура ОбменДанными, с ключом Загрузка
// 
// Возвращаемое значение:
//   Произвольный, СправочникОбъект, ДокументОбъект, НаборЗаписей - созданный и записанный элемент
//
Функция Тест_Создать(Знач Параметры = Неопределено) Экспорт
    
	ПараметрыДанных = Тест_Параметры();
    Если ЗначениеЗаполнено(Параметры) Тогда
		ПараметрыДанных = Тест_СозданиеДанных.ДополнитьПараметры(ПараметрыДанных, Параметры);
	КонецЕсли;
	
    НовыйЭлемент = Документы.ДокументСДвижениями.СоздатьДокумент();
	
	Для Каждого ОписаниеСтроки Из Параметры.ТабЧасть Цикл
		НоваяСтрока = НовыйЭлемент.ТЧ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеСтроки);
	КонецЦикла;

	Возврат Тест_СозданиеДанных.Создать(НовыйЭлемент, ПараметрыДанных);

КонецФункции

#КонецОбласти 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СоздателиТестовыхДанных

#КонецОбласти

#КонецОбласти
