
#Область Служебные_функции_и_процедуры

// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,ОписаниеШага,ТипШага,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"УстановленOneScript()","УстановленOneScript","Когда установлен OneScript","","");

	Возврат ВсеТесты;
КонецФункции

// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакет(ИмяМакета);
КонецФункции

#КонецОбласти



#Область Работа_со_сценариями

// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

//Когда установлен OneScript
//@УстановленOneScript()
Процедура УстановленOneScript() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	Ожидаем = Ванесса.Плагин("УтвержденияBDD");
	
	УправлениеПриложениями = Ванесса.Плагин("УправлениеПриложениями");
	Установлен = УправлениеПриложениями.УстановленOneScript();
	
	Ожидаем.Что(Установлен, "OneScript должен быть установлен, а это не так.")
		.ЭтоИстина();
	//ВызватьИсключение "Не реализовано.";
КонецПроцедуры
