&НаКлиенте
Перем ПутьКФайлуПолный Экспорт;// в эту переменную будет установлен правильный клиентский путь к текущему файлу

// { Plugin interface

// Вернуть описание плагина в виде структуры со спец.ключами
//
// Параметры:
//   ВозможныеТипыПлагинов - ФиксированнаяСтруктура -
//
//  Возвращаемое значение:
//   Структура - структура-результат
//
&НаКлиенте
Функция ОписаниеПлагина(ВозможныеТипыПлагинов) Экспорт
	Возврат ОписаниеПлагинаНаСервере(ВозможныеТипыПлагинов);
КонецФункции

// Инициализация плагина
//
// Параметры:
//   КонтекстЯдраПараметр - объект браузера тестов -
//
&НаКлиенте
Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
КонецПроцедуры

&НаСервере
Функция ОписаниеПлагинаНаСервере(ВозможныеТипыПлагинов)
	Возврат ЭтотОбъектНаСервере().ОписаниеПлагина(ВозможныеТипыПлагинов);
КонецФункции
// } Plugin interface

// { Report generator interface

// Создать отчет, который будет в функцию "Показать"
//
// Параметры:
//   КонтекстЯдра - Объект - Объект браузера тестов
//   РезультатыТестирования - Структура, Соответствие -
//
//  Возвращаемое значение:
//   Любой - результат, который будет в функцию "Показать"
//
&НаКлиенте
Функция СоздатьОтчет(КонтекстЯдра, РезультатТестирования) Экспорт
	Объект.ТипыУзловДереваТестов = КонтекстЯдра.Плагин("ПостроительДереваТестов").Объект.ТипыУзловДереваТестов;
	Объект.СостоянияТестов = КонтекстЯдра.Объект.СостоянияТестов;
	ВызватьИсключение "Метод не реализован";
	Возврат Неопределено; //Возвращается рельный отчет
КонецФункции

// Показать отчет о тестировании на клиенте
//
// Параметры:
//   Отчет - <Тип.Вид> - отчет, ранее возвращенный в функции СоздатьОтчет
//
&НаКлиенте
Процедура Показать(Отчет) Экспорт
	ВызватьИсключение "Метод не реализован";
КонецПроцедуры

// Сохранить результаты тестирования в файл
//
// Параметры:
//   Отчет - <Тип.Вид> - <описание параметра>
//   ПолныйПутьФайла - <Тип.Вид> - <описание параметра>
//
&НаКлиенте
Процедура Экспортировать(Отчет, ПолныйПутьФайла) Экспорт
	ВызватьИсключение "Метод не реализован";
КонецПроцедуры
// } Report generator interface

// { Helpers
&НаСервере
Функция ЭтотОбъектНаСервере()
	Возврат РеквизитФормыВЗначение("Объект");
КонецФункции
// } Helpers
