Перем КонтекстЯдраПеременная;
Перем Ожидаем;
Перем СериализаторMXL;

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
    
    КонтекстЯдраПеременная = КонтекстЯдраПараметр;
    Ожидаем                = КонтекстЯдраПараметр.Плагин("УтвержденияBDD");
    СериализаторMXL        = КонтекстЯдраПараметр.Плагин("СериализаторMXL");
    
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов, КонтекстЯдра) Экспорт
    
    НаборТестов.НачатьГруппу("Группа тестов", Истина);
    
    Значение = 2;
    
    КонтекстЯдраПеременная.СохранитьКонтекст(Значение);
    
    НаборТестов.Добавить("ТестДолжен_ПолучитьЗначениеИзКонтекста", НаборТестов.ПараметрыТеста(Значение));
    
КонецПроцедуры

//{ Блок юнит-тестов

Процедура ПередЗапускомТеста() Экспорт
    НачатьТранзакцию();
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
    Если ТранзакцияАктивна() Тогда
        ОтменитьТранзакцию();
    КонецЕсли;
КонецПроцедуры

Процедура ТестДолжен_ПолучитьЗначениеИзКонтекста(Значение)
    
    ЗначениеИзКонтекста = КонтекстЯдраПеременная.ПолучитьКонтекст();
    
    Ожидаем.Что(ЗначениеИзКонтекста, "Ожидали что значение полученное из контекста будет равно ожидаемому.").Равно(Значение);
    
КонецПроцедуры

//} Блок юнит-тестов

