&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОтключитьИнтернетПоддержкуУВсехПользователейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьИнтернетПоддержкуУВсехПользователей(Команда)
    ОтключитьИнтернетПоддержкуУВсехПользователейНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтключитьИнтернетПоддержкуУВсехПользователейНаСервере()
    
    Перем Пользователи;
    
    Пользователи = ПользователиИнформационнойБазы.ПолучитьПользователей();
    Для Каждого Пользователь Из Пользователи Цикл
        ХранилищеОбщихНастроек.Сохранить("ИнтернетПоддержкаПользователей", "ВсегдаПоказыватьПриСтартеПрограммы", Ложь, , Пользователь.Имя);
        Сообщить("Для пользователя " + Пользователь.Имя + " интернет-поддержка отключена");
    КонецЦикла;
    
КонецПроцедуры
