#Область СлужебныйПрограммныйИнтерфейс

#Область ВнешнийИнтерфейсПлагина

Процедура Инициализация(КонтекстЯдра) Экспорт
КонецПроцедуры

Функция ОписаниеПлагина(КонтекстЯдра, ВозможныеТипыПлагинов) Экспорт
	Возврат ОписаниеПлагинаНаСервере(ВозможныеТипыПлагинов);
КонецФункции

#КонецОбласти

#Область ВнутреннийИнтерфейсПлагина

Функция ОписаниеПлагинаНаСервере(ВозможныеТипыПлагинов) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Тип", ВозможныеТипыПлагинов.ГенераторОтчета);
	Результат.Вставить("Идентификатор", Метаданные().Имя);
	Результат.Вставить("Представление", Метаданные().Представление());
	Результат.Вставить("ПотоковыйВывод", Истина);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

#КонецОбласти

#КонецОбласти
