#Область ПеременныеФормы

&НаКлиенте
Перем АСинк;

#КонецОбласти

#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	Перем АдресХранилища, ИмяФормы;

	ИмяФормы        = "Форма";
	ФайлИнструмента = Новый Файл(ПутьФайла);
	ИмяИнструмента  = ФайлИнструмента.ИмяБезРасширения;

	//Если Не Существует Тогда
	//	Сообщить("Инструмент <" + ИмяИнструмента + "> не найден в каталоге <" + ФайлИнструмента.Путь + ">");
	//	Возврат;
	//КонецЕсли;

	Оповещение = АСинк().смв_НовыйОписаниеОповещения("ОткрытьФайлЗавершение", ЭтаФорма,
		Новый Структура("ИмяИнструмента, ИмяФормыИнструмента", ИмяИнструмента, ИмяФормы));
	АСинк().смв_ПоместитьФайл(Оповещение, АдресХранилища, ФайлИнструмента.ПолноеИмя, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПутьФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ОповещениеВыбора = АСинк().смв_НовыйОписаниеОповещения("ВыборФайлаЗавершение", ЭтаФорма);
	Асинк().смв_ПоказатьДиалогОткрытие(ОповещениеВыбора,
										"*.epf|*.epf",
										"Выберите внешнюю обработку",
										,
										ПутьФайлаНастроек());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДопПараметры) Экспорт

	Если ВыбранныеФайлы = Неопределено или ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныйФайл = ВыбранныеФайлы.Получить(0);
	ПутьФайла = ВыбранныйФайл;

	//ФайлНастройки = ВыбранныеФайлы.Получить(0);
	//Объект.ПутьФайлаНастроек = ФайлНастройки;
	
	//ПлагинНастроек = Плагин("Настройки");
	//ПлагинНастроек.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт

	ИмяИнструмента = ДополнительныеПараметры.ИмяИнструмента;
	ИмяФормыИнструмента = ДополнительныеПараметры.ИмяФормыИнструмента;

	ПодключитьФайлОбработкиНаСервере(Адрес, ИмяИнструмента);

	ФормаИнструмента = ПолучитьФорму("ВнешняяОбработка." + ИмяИнструмента + "." + ИмяФормыИнструмента);
	Если ФормаИнструмента = Неопределено Тогда
		Сообщить("Инструмент <" + ИмяИнструмента + ">: не удалось получить основную форму!");
		Возврат;
	КонецЕсли;

	ФормаИнструмента.Открыть();
	ФормаИнструмента = Неопределено;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПодключитьФайлОбработкиНаСервере(Знач АдресХранилища, Знач ИдентификаторОбработки, ЭтоОтчет = Ложь)
	Если ЭтоОтчет = Истина Тогда
		ВнешниеОтчеты.Подключить(АдресХранилища, ИдентификаторОбработки, Ложь);
	Иначе
		ВнешниеОбработки.Подключить(АдресХранилища, ИдентификаторОбработки, Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПутьФайлаНастроек()
	Возврат "";
КонецФункции

&НаКлиенте
Функция АСинк() Экспорт

	Если АСинк = Неопределено Тогда

		АСинк = ПолучитьФорму("Обработка.ОткрытьВнешнийФайл.Форма.МодульАсинк", , ЭтаФорма, ЭтаФорма);

		АСинк.МодальностьЗапрещена = Истина; //ЕстьПоддержкаАсинхронныхВызовов;
		АСинк.Версия8315ИлиВыше = Ложь; //Версия8315ИлиВыше;

	КонецЕсли;

	Возврат АСинк;

КонецФункции

#КонецОбласти
