//начало текста модуля

Перем Ванесса;

Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	// описание шагов
	//пример вызова Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯУверенЧтоЭтотШагНеБудетВыполняться()","ЯУверенЧтоЭтотШагНеБудетВыполняться","Когда Я уверен что этот шаг не будет выполняться");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВозвратВХостСистему()","ВозвратВХостСистему","Когда Возврат в хост систему");

	Возврат ВсеТесты;
КонецФункции


Процедура ПередНачаломСценария() Экспорт
	Если КонтекстСохраняемый.Свойство("УжеБылаОшибкаВПередНачаломСценария") Тогда
		Возврат;
	КонецЕсли;	
	
	КонтекстСохраняемый.Вставить("УжеБылаОшибкаВПередНачаломСценария");
	
	ВызватьИсключение "Исключение в ПередНачаломСценария";
КонецПроцедуры


Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



//Когда Я уверен что этот шаг не будет выполняться
//@ЯУверенЧтоЭтотШагНеБудетВыполняться()
Процедура ЯУверенЧтоЭтотШагНеБудетВыполняться() Экспорт
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры


//Когда Возврат в хост систему
//@ВозвратВХостСистему()
Процедура ВозвратВХостСистему() Экспорт
	Ванесса.ПолучитьФорму("Форма").ХостСистема.ПродолжитьВыполнениеШагов();
КонецПроцедуры


//окончание текста модуля

  