//https://infostart.ru/public/369487/
//соответствие стандартных обработок внутренним адресам платформы.

//1. Активные пользователи - "v8res://mngbase/StandardActiveUsers.epf";
//2. Журнал регистрации - "v8res://mngbase/StandardEventLog.epf";
//3. Поиск ссылок на объект - "v8res://mngbase/StandardFindByRef.epf";
//4. Проведение документов - "v8res://mngbase/StandardDocumentsPosting.epf";
//5. Удаление помеченных объектов - "v8res://mngbase/StandardDeleteMarkedObjects.epf";
//6. Управление внешними источниками данных - "v8res://mngbase/StandardExternalDataSourcesManagement.epf";
//7. Управление итогами - "v8res://mngbase/StandardTotalsManagement.epf";
//8. Управление полнотекстовым поиском - "v8res://mngbase/StandardFullTextSearchManagement.epf";
//9. Управление расширениями конфигурации - "v8res://mngbase/StandardExtensionsManagement.epf";
//10. upd. с 8.3.11. Управление системой взаимодействия  - "v8res://mngbase/StandardECSRegister.epf"

//И еще одна обработочка. Не входит в стандартные, но тоже полезна для ознакомления.

//11. Конструктор запросов на управляемых формах - "v8res://mngbase/QueryWizard.epf";

&НаСервереБезКонтекста
Процедура ВыполнитьСерверныйКодНаСервере(СерверныйКод)
	Выполнить(СерверныйКод);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСерверныйКод(Команда)
	ВыполнитьСерверныйКодНаСервере(ЭтаФорма.Код);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВстроеннуюФорму1С(ИмяФормы)
    ПодключитьВнешнююОбработкуНаСервере("v8res://mngbase/" + ИмяФормы + ".epf", ИмяФормы);
    ОткрытьФорму("ВнешняяОбработка." + ИмяФормы + ".Форма");
КонецПроцедуры

&НаСервере
Процедура ПодключитьВнешнююОбработкуНаСервере(ПутьОбработки, ИмяФормы)
    ВнешниеОбработки.Подключить(ПутьОбработки, ИмяФормы, false);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРасширений(Команда)
	ОткрытьВстроеннуюФорму1С("StandardExtensionsManagement");
КонецПроцедуры
