//начало текста модуля
&НаКлиенте
Перем Ванесса;

&НаКлиенте
Перем Контекст Экспорт;

&НаКлиенте
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;

	ВсеТесты = Новый Массив;

	// описание шагов
	//пример вызова Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯПрервалВыполнениеШаговВХостСистемеИЯНажалНаКнопку(Парам01Строка)","ЯПрервалВыполнениеШаговВХостСистемеИЯНажалНаКнопку","я прервал выполнение шагов в хост системе и я нажал на кнопку ""ВыполнитьСценарии""");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВТестируемомЭкземпляреВыполнилсяСценарий()","ВТестируемомЭкземпляреВыполнилсяСценарий","в тестируемом экземпляре выполнился сценарий");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯПродолжилВыполнениеШаговВХостСистеме()","ЯПродолжилВыполнениеШаговВХостСистеме","Я продолжил выполнение шагов в хост системе");

	Возврат ВсеТесты;
КонецФункции

&НаСервере
Функция ПолучитьМакетСервер()
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет("Макет");
КонецФункции

&НаКлиенте
Процедура ПередНачаломСценария() Экспорт

	Ванесса.ПосмотретьЗначение(Контекст);

	//подложим специальную epf, как будто она уже была там
	ПутьКудаПоложитьEPF = Ванесса.Объект.КаталогИнструментов + СтрЗаменить("\features\Support\Templates\step_definitions\ПростаяФичаДляПроверкиРаботыВыполненияСценария.epf", "\", "/");
	ФайлПроверкаСуществования = Новый Файл(ПутьКудаПоложитьEPF);
	Контекст.Вставить("ПутьКудаПоложитьEPF",ПутьКудаПоложитьEPF);
	Если Ванесса.ФайлСуществуетКомандаСистемы(ФайлПроверкаСуществования.ПолноеИмя) Тогда
		Ванесса.УдалитьФайлыКомандаСистемы(ПутьКудаПоложитьEPF);
	КонецЕсли;

	Макет = ПолучитьМакетСервер();
	Макет.Записать(ПутьКудаПоложитьEPF);
КонецПроцедуры

&НаКлиенте
Процедура ПередОкончаниемСценария() Экспорт
	Ванесса.УдалитьФайлыКомандаСистемы(Контекст.ПутьКудаПоложитьEPF);

	//безусловное закрытие формы если она осталась
	Попытка
	    ОткрытаяФормаVanessaADD = Контекст.ОткрытаяФормаVanessaADD;
		ОткрытаяФормаVanessaADD.Закрыть();
	Исключение

	КонецПопытки;
КонецПроцедуры

&НаКлиенте
//я прервал выполнение шагов в хост системе и я нажал на кнопку "ВыполнитьСценарии"
//@ЯПрервалВыполнениеШаговВХостСистемеИЯНажалНаКнопку(Парам01Строка)
Процедура ЯПрервалВыполнениеШаговВХостСистемеИЯНажалНаКнопку(ИмяПроцедуры) Экспорт
	ХостФорма = Ванесса;
	ХостФорма.ЗапретитьВыполнениеШагов();

	ОткрытаяФормаVanessaADD = Контекст.ОткрытаяФормаVanessaADD;
	Выполнить("ОткрытаяФормаVanessaADD." + ИмяПроцедуры +"();");


КонецПроцедуры


&НаКлиенте
Процедура ПроверитьЧтоШагВыполнился(ДеревоСтроки,БылУспешныйШаг)
	Для каждого СтрокаДерева Из ДеревоСтроки Цикл
		Если СтрокаДерева.Тип = "Шаг" Тогда
			Если СтрокаДерева.Статус = "Success" Тогда
				БылУспешныйШаг = Истина;
			КонецЕсли;
		Иначе
			ПроверитьЧтоШагВыполнился(СтрокаДерева.ПолучитьЭлементы(),БылУспешныйШаг);
		КонецЕсли;
	КонецЦикла;

	Ванесса.ПроверитьРавенство(БылУспешныйШаг,Истина,"Был хотя бы один успешный шаг.");
КонецПроцедуры

&НаКлиенте
//в тестируемом экземпляре выполнился сценарий
//@ВТестируемомЭкземпляреВыполнилсяСценарий()
Процедура ВТестируемомЭкземпляреВыполнилсяСценарий() Экспорт
	БылУспешныйШаг = Ложь;

	ПроверитьЧтоШагВыполнился(Контекст.ОткрытаяФормаVanessaADD.Объект.ДеревоТестов.ПолучитьЭлементы(),БылУспешныйШаг);
КонецПроцедуры

&НаКлиенте
//Я продолжил выполнение шагов в хост системе
//@ЯПродолжилВыполнениеШаговВХостСистеме()
Процедура ЯПродолжилВыполнениеШаговВХостСистеме() Экспорт
КонецПроцедуры

//окончание текста модуля