
&НаКлиенте
Перем ТестШпион Экспорт;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭлементОтбора = Таблица.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
 	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Справочники.Справочник1.ПустаяСсылка(); 	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПриАктивизацииСтроки(Элемент)
	Если НЕ Элемент.ДанныеСтроки(Ссылка) = Неопределено
		 И НЕ ТестШпион = Неопределено
		 И ТестШпион.Свойство("ТаблицаПриАктивизацииСтроки") Тогда
		Пока ТестШпион.ТаблицаПриАктивизацииСтроки.Количество() > 0 Цикл
			Оповещение = ТестШпион.ТаблицаПриАктивизацииСтроки[0];
			ТестШпион.ТаблицаПриАктивизацииСтроки.Удалить(0);
			ВыполнитьОбработкуОповещения(Оповещение); 
		КонецЦикла; 
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	РезультатОповещения = Новый Структура("ИмяСобытия,Параметр,Источник",ИмяСобытия, Параметр, Источник); 
КонецПроцедуры

&НаКлиенте
Процедура Отбор(Команда)
	ОтборНаСервере();
	Элементы.Таблица.Обновить();
КонецПроцедуры

&НаСервере
Процедура ОтборНаСервере()
	ЭлементОтбора = Таблица.Отбор.Элементы[0];
 	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Ссылка; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Справочник1.Ссылка
		|ИЗ
		|	Справочник.Справочник1 КАК Справочник1
		|ГДЕ
		|	Справочник1.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СсылкаЕстьВБД = РезультатЗапроса.Выгрузить()[0].Ссылка = Ссылка;
		
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ТаблицаПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	К = "123";
КонецПроцедуры

