# language: ru

@exportscenarios
@IgnoreOn82Builds
@IgnoreOnOFBuilds

Функционал: Открытие форм объектов, используя переменную загруженную из макета

Как Разработчик я хочу
Чтобы я мог открывать формы объектов, используя переменную загруженную из макета
Чтобы я мог использовать это в своих сценариях

Контекст: 
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Я открываю основные формы объектов из переменных
	Когда я загружаю макет "МакетСПеременными" с переменными
	|"Основной"			 							 |"СправочникСклад"|
	|"ВентиляторBinatone"							 |"СправочникТовары"|
	|"ПриходнаяНакладная000000001От24_08_201811_57_50"|"ДокументПриходнаяНакладная"|
	И Я открываю основную форму объекта из переменной "СправочникСклад"
	Тогда открылась форма с именем "Справочник.Склады.ФормаОбъекта"
	И Я закрываю текущее окно
	И Я открываю основную форму справочника из переменной "СправочникТовары"
	Тогда открылась форма с именем "Справочник.Товары.ФормаОбъекта"
	И Я закрываю текущее окно
	И Я открываю основную форму документа из переменной "ДокументПриходнаяНакладная"
	Тогда открылась форма с именем "Документ.ПриходнаяНакладная.ФормаОбъекта"
	И Я закрываю текущее окно
