
#Область Служебные_функции_и_процедуры

&НаКлиенте
// контекст фреймворка Vanessa-ADD
Перем Ванесса;

&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;

&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-ADD.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;

	ВсеТесты = Новый Массив;

	// описание шагов
	// пример вызова Ванесса.ДобавитьШагВМассивТестов(ВсеТесты, Снипет, ИмяПроцедуры, ПредставлениеТеста, ОписаниеШага, ТипШагаДляОписания, ТипШагаВДереве);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯОткрываюОсновнуюФормуОбъектаИзПеременной(Парам01)","ЯОткрываюОсновнуюФормуОбъектаИзПеременной",
		"И Я открываю основную форму объекта из переменной ""ИмяПеременнойИзМакета""","Открывает основную форму объекта из переменной, сохраненной в контекст при загрузке из макета",
		"UI.Формы.Открыть форму объекта");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯОткрываюОсновнуюФормуСправочникаИзПеременной(Парам01)","ЯОткрываюОсновнуюФормуСправочникаИзПеременной",
		"И Я открываю основную форму справочника из переменной ""ИмяПеременнойИзМакета""","Открывает основную форму справочника из переменной, сохраненной в контекст при загрузке из макета",
		"UI.Формы.Открыть форму объекта");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯОткрываюОсновнуюФормуДокументаИзПеременной(Парам01)","ЯОткрываюОсновнуюФормуДокументаИзПеременной",
		"И Я открываю основную форму документа из переменной ""ИмяПеременнойИзМакета""","Открывает основную форму документа из переменной, сохраненной в контекст при загрузке из макета",
		"UI.Формы.Открыть форму объекта");

	Возврат ВсеТесты;
КонецФункции

&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции

&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции

#КонецОбласти



#Область Работа_со_сценариями

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт

КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт

КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//И Я открываю основную форму объекта из переменной "ИмяПеременнойИзМакета"
//@ЯОткрываюОсновнуюФормуОбъектаИзПеременной(Парам01)
Процедура ЯОткрываюОсновнуюФормуОбъектаИзПеременной(Парам01) Экспорт

	Попытка
		СсылкаНаОбъект = Контекст[Парам01];
	Исключение
		ВызватьИсключение "Не обнаружена ссылка на объект " + Парам01 + " сохраненный в контексте";
	КонецПопытки;

	НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(СсылкаНаОбъект);
	АктивноеОкно = Ванесса.ПолучитьГлавноеОкноИзТестовоеПриложение();
	АктивноеОкно.ВыполнитьКоманду(НавигационнаяСсылка);

КонецПроцедуры

&НаКлиенте
//И Я открываю основную форму справочника из переменной "ИмяПеременнойИзМакета"
//@ЯОткрываюОсновнуюФормуСправочникаИзПеременной(Парам01)
Процедура ЯОткрываюОсновнуюФормуСправочникаИзПеременной(Парам01) Экспорт

	ЯОткрываюОсновнуюФормуОбъектаИзПеременной(Парам01);

КонецПроцедуры

&НаКлиенте
//И Я открываю основную форму документа из переменной "ИмяПеременнойИзМакета"
//@ЯОткрываюОсновнуюФормуДокументаИзПеременной(Парам01)
Процедура ЯОткрываюОсновнуюФормуДокументаИзПеременной(Парам01) Экспорт

	ЯОткрываюОсновнуюФормуОбъектаИзПеременной(Парам01);

КонецПроцедуры
