//начало текста модуля

Перем Ванесса;

Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;

	ВсеТесты = Новый Массив;

	// описание шагов
	//пример вызова Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯДобавилТегВСписокТеговИсключений(Парам01Строка)","ЯДобавилТегВСписокТеговИсключений","Я добавил тег ""IgnoreOnCIMainBuild"" в список тегов исключений");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯЗагрузилФичиИзСлужебногоКаталога(Парам01Строка)","ЯЗагрузилФичиИзСлужебногоКаталога","Я загрузил фичи из служебного каталога ""Support\Templates""");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВДеревеФичНетФичиЗагруженнойИзФайла(Парам01Строка)","ВДеревеФичНетФичиЗагруженнойИзФайла","в дереве фич нет фичи загруженной из файла ""ОсновнаяТестоваяФича""");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯДобавилТегВСписокТеговФильтров(Парам01Строка)","ЯДобавилТегВСписокТеговФильтров","Я добавил тег ""SpecialTag"" в список тегов фильтров");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВДеревеФичЕстьФичаЗагруженнаяИзФайла(Парам01Строка)","ВДеревеФичЕстьФичаЗагруженнаяИзФайла","в дереве фич есть фича загруженная из файла ""ОсновнаяТестоваяФича""");

	Возврат ВсеТесты;
КонецФункции

Процедура ПередОкончаниемСценария() Экспорт
	Попытка
		Если Контекст.Свойство("ОткрытаяФормаVanessaADD") Тогда
			ОткрытаяФормаVanessaADD = Контекст.ОткрытаяФормаVanessaADD;
			ОткрытаяФормаVanessaADD.Закрыть();
		КонецЕсли;
	Исключение

	КонецПопытки;
КонецПроцедуры

//Я добавил тег "@IgnoreOnCIMainBuild" в список тегов исключений
//@ЯДобавилТегВСписокТеговИсключений(Парам01Строка)
Процедура ЯДобавилТегВСписокТеговИсключений(ИмяТега) Экспорт
	ФормаVB = Контекст.ОткрытаяФормаVanessaADD;
	ФормаVB.СписокТеговИсключение.Добавить(ИмяТега);
КонецПроцедуры

//Я загрузил фичи из служебного каталога "Support\Templates"
//@ЯЗагрузилФичиИзСлужебногоКаталога(Парам01Строка)
Процедура ЯЗагрузилФичиИзСлужебногоКаталога(ОтносительныйПуть) Экспорт
	Путь = Ванесса.КаталогИнструментов + СтрЗаменить("\features\" + ОтносительныйПуть, "\", "/");
	ФормаVB = Контекст.ОткрытаяФормаVanessaADD;

	ФормаVB.КаталогФич = Путь;

	ФормаVB.ЗагрузитьФичи();
КонецПроцедуры

//в дереве фич нет фичи загруженной из файла "ОсновнаяТестоваяФича.feature"
//@ВДеревеФичНетФичиЗагруженнойИзФайла(Парам01Строка)
Процедура ВДеревеФичНетФичиЗагруженнойИзФайла(ИмяФичаФайла) Экспорт
	ФормаVB = Контекст.ОткрытаяФормаVanessaADD;
	ДеревоТестов = ФормаVB.ДеревоТестов;

	Ванесса.ПроверитьРавенство(ДеревоТестов.Строки[0].Имя,"Templates","В корне дерева должен быть нужный каталог.");

	Строки = ДеревоТестов.Строки[0].Строки;
	Для каждого Строка Из Строки Цикл
		Если НРег(Строка.Имя) = НРег(ИмяФичаФайла) Тогда
			ВызватьИсключение "Фича " + ИмяФичаФайла + " загрузилась в дерево, хотя не должна была загрузиться.";
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

//Я добавил тег "SpecialTag" в список тегов фильтров
//@ЯДобавилТегВСписокТеговФильтров(Парам01Строка)
Процедура ЯДобавилТегВСписокТеговФильтров(ИмяТега) Экспорт
	ФормаVB = Контекст.ОткрытаяФормаVanessaADD;
	ФормаVB.СписокТеговОтбор.Добавить(ИмяТега);
КонецПроцедуры

//в дереве фич есть фича загруженная из файла "ОсновнаяТестоваяФича"
//@ВДеревеФичЕстьФичаЗагруженнаяИзФайла(Парам01Строка)
Процедура ВДеревеФичЕстьФичаЗагруженнаяИзФайла(ИмяФичаФайла) Экспорт
	ФормаVB = Контекст.ОткрытаяФормаVanessaADD;
	ДеревоТестов = ФормаVB.ДеревоТестов;

	Ванесса.ПроверитьРавенство(ДеревоТестов.Строки[0].Имя,"Templates","В корне дерева должен быть нужный каталог.");

	Нашел = Ложь;
	Строки = ДеревоТестов.Строки[0].Строки;
	Для каждого Строка Из Строки Цикл
		Если НРег(Строка.Имя) = НРег(ИмяФичаФайла) Тогда
			Нашел = Истина;
		КонецЕсли;
	КонецЦикла;

	Если Не Нашел Тогда
		ВызватьИсключение "Фича " + ИмяФичаФайла + " не загрузилась в дерево, хотя должна была загрузиться.";
	КонецЕсли;
КонецПроцедуры

//окончание текста модуля
