// { Plugin interface
&НаКлиенте
Перем ПутьКФайлуПолный Экспорт;// в эту переменную будет установлен правильный клиентский путь к текущему файлу

// { Plugin interface
&НаКлиенте
Функция ОписаниеПлагина(ВозможныеТипыПлагинов) Экспорт
	Возврат ОписаниеПлагинаНаСервере(ВозможныеТипыПлагинов);
КонецФункции

&НаКлиенте
Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
КонецПроцедуры

&НаСервере
Функция ОписаниеПлагинаНаСервере(ВозможныеТипыПлагинов)
	Возврат ЭтотОбъектНаСервере().ОписаниеПлагина(ВозможныеТипыПлагинов);
КонецФункции
// } Plugin interface

// { API

&НаКлиенте
Процедура ОткрытьФайл(Знач Путь, Знач КодировкаФайла = "utf-8", Знач Добавлять = Истина) Экспорт
	ПутьФайла = Путь;
	Кодировка = КодировкаФайла;
	
	мФайлЛога = Новый ЗаписьТекста(ПутьФайла, Кодировка,,Добавлять);
	мФайлЛога.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Вывести(Знач Сообщение) Экспорт
	
	мФайлЛога = Новый ЗаписьТекста(Объект.ПутьФайла, Объект.Кодировка,,Истина);
	мФайлЛога.ЗаписатьСтроку(Сообщение);
	мФайлЛога.Закрыть();
	
КонецПроцедуры

// } API

// { Helpers
&НаСервере
Функция ЭтотОбъектНаСервере()
	Возврат РеквизитФормыВЗначение("Объект");
КонецФункции
// } Helpers
