//начало текста модуля

Перем Ванесса;

Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	// описание шагов
	//пример вызова Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Возврат ВсеТесты;
КонецФункции


Процедура ПередНачаломСценария() Экспорт
КонецПроцедуры


Процедура ПередОкончаниемСценария() Экспорт
	Если КонтекстСохраняемый.Свойство("УжеБылаОшибкаВПередОкончаниемСценария") Тогда
		Возврат;
	КонецЕсли;	
	
	КонтекстСохраняемый.Вставить("УжеБылаОшибкаВПередОкончаниемСценария");
	
	ВызватьИсключение "Исключение в ПередОкончаниемСценария";
КонецПроцедуры


//окончание текста модуля

  