#language:ru

@IgnoreOn82Builds
@IgnoreOnOFBuilds
@IgnoreOnCIMainBuild

Функционал: Добавлять различные метки в отчет allure через вызов служебного шага
	Как Разработчик я хочу добавить готовые шаги для установки уровня серьезности выполнения или ошибки фичи *Я устанавливаю severity 'blocker/critical/normal/'*
	
	Дополнительно ожидаю, что через шаг данной фичи я смогу установить текст названия фичи для красивого вывода в behavior *Я устанавливаю название фичи 'Мой дивный чудный мир'*
	
	Я хочу так же устанавливать шагом в контексте ручное выполнение шагов *Я устанавливаю ручное выполнение сценария*
	
	Я хочу прерывать выполнение шагов с помощью специального сниппета *Я вызываю исключение не дано*
	

Сценарий: Установка различных меток для сценария или фича файла
	Когда Я устанавливаю severity 'critical'
	Когда Я устанавливаю название фичи 'Мой дивный чудный мир'
	Тогда Я устанавливаю метке 'issue' значение 'SUP-123'
	И Я устанавливаю метке 'suite' значение 'Suite1'
	И Я подключаю файл '$instrumentsRoot/features/libraries/manually/setlabelsallure.feature' к шагу
	И Я устанавливаю ссылку 'http://localhost/index.html' с именем 'МояСсылка'
	И Я устанавливаю ссылку 'http://localhost/index.html' с именем 'МояСсылка2' с типом 'tms'
	И Я устанавливаю метке 'parentSuite' значение 'Подраздел'
	И Я устанавливаю метке 'subSuite' значение 'ПодразделПодраздела'
	Когда Я устанавливаю ручное выполнение сценария
	И Я устанавливаю ручное выполнение сценария
	И Я вызываю исключение не дано
