//начало текста модуля

///////////////////////////////////////////////////
//Служебная часть
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-ADD
Перем Ванесса;

&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;

&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-ADD.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;

	ВсеТесты = Новый Массив;

	// описание шагов
	//пример вызова Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯНажимаюНаКнопкуVanessa_ADD(Парам01)","ЯНажимаюНаКнопкуVanessa_ADD","Когда я нажимаю на кнопку Vanessa-ADD ""Начать запись поведения""");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВРеквизитеVanessa_ADDБудетСодержатьсяСтрока(Парам01,Парам02)","ВРеквизитеVanessa_ADDБудетСодержатьсяСтрока","Тогда В реквизите Vanessa-ADD ""СгенерированныйСценарий"" будет содержаться строка ""ываыва""");

	Возврат ВсеТесты;
КонецФункции

&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции

&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт

КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт

КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Когда я нажимаю на кнопку Vanessa-ADD "Начать запись поведения"
//@ЯНажимаюНаКнопкуVanessa_ADD(Парам01)
Процедура ЯНажимаюНаКнопкуVanessa_ADD(ИмяКнопки) Экспорт
	Если ИмяКнопки = "Начать запись поведения" Тогда
		Ванесса.НачатьЗаписьДействийПользователя();
	ИначеЕсли ИмяКнопки = "Закончить запись поведения" Тогда
		Ванесса.ЗавершитьЗаписьДействийПользователя();
	ИначеЕсли ИмяКнопки = "Забыть состояние формы TestClient" Тогда
		Ванесса.ЗабытьСостояниеФормыTestClient();
	ИначеЕсли ИмяКнопки = "ПолучитьИзмененияФормыGherkin" Тогда
		Ванесса.ПолучитьИзмененияФормыGherkin();
	ИначеЕсли ИмяКнопки = "Запомнить состояние формы TestClient" Тогда
		Ванесса.ЗапомнитьСостояниеФормыTestClient();
	Иначе
		ВызватьИсключение "Не описано действие для кнопки """ + ИмяКнопки + """";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
//Тогда В реквизите Vanessa-ADD "СгенерированныйСценарий" будет содержаться строка "ываыва"
//@ВРеквизитеVanessa_ADDБудетСодержатьсяСтрока(Парам01,Парам02)
Процедура ВРеквизитеVanessa_ADDБудетСодержатьсяСтрока(Имяреквизита,ОжидаемаяСтрока) Экспорт
	Поз = Найти(Ванесса.Объект[Имяреквизита],ОжидаемаяСтрока);

	Если Поз = 0 Тогда
		Стр1 = СтрЗаменить(Ванесса.Объект[Имяреквизита],"""","'");
		Стр2 = СтрЗаменить(ОжидаемаяСтрока,"""","'");
		Поз = Найти(Стр1,Стр2);
	КонецЕсли;

	Если Поз = 0 Тогда
		ВызватьИсключение "Строка " + ОжидаемаяСтрока + " не найдена в реквизите " + Имяреквизита;
	КонецЕсли;
КонецПроцедуры

//окончание текста модуля
