//начало текста модуля

Перем Ванесса;

Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	// описание шагов
	//пример вызова Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯОстанавливаюВыполнениеШаговДляИспользованияТаймера()","ЯОстанавливаюВыполнениеШаговДляИспользованияТаймера","Когда Я останавливаю выполнение шагов для использования таймера");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВторойШагПоместитВПеременнуюКонтекстСлужебноеЗначение(Парам01)","ВторойШагПоместитВПеременнуюКонтекстСлужебноеЗначение","Второй шаг поместит в переменную контекст служебное значение ""Тест""");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"НаТретьемШагеЯМогуОбратитьсяКЭтомуСлужебномуЗначению(Парам01)","НаТретьемШагеЯМогуОбратитьсяКЭтомуСлужебномуЗначению","на третьем шаге я могу обратиться к этому служебному значению ""Тест""");

	Возврат ВсеТесты;
КонецФункции


Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры


Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры




//Когда Я останавливаю выполнение шагов для использования таймера
//@ЯОстанавливаюВыполнениеШаговДляИспользованияТаймера()
Процедура ЯОстанавливаюВыполнениеШаговДляИспользованияТаймера() Экспорт
	Ванесса.ЗапретитьВыполнениеШагов();
	
	ОбычнаяФорма = ПолучитьФорму("ОбычнаяФорма");
	ОбычнаяФорма.ПодключитьТаймер(Ванесса);
	ОбычнаяФорма.Открыть();
	
КонецПроцедуры



//Второй шаг поместит в переменную контекст служебное значение "Тест"
//@ВторойШагПоместитВПеременнуюКонтекстСлужебноеЗначение(Парам01)
Процедура ВторойШагПоместитВПеременнуюКонтекстСлужебноеЗначение(Парам01) Экспорт
	Контекст.Вставить(Парам01,Истина);
КонецПроцедуры


//на третьем шаге я могу обратиться к этому служебному значению "Тест"
//@НаТретьемШагеЯМогуОбратитьсяКЭтомуСлужебномуЗначению(Парам01)
Процедура НаТретьемШагеЯМогуОбратитьсяКЭтомуСлужебномуЗначению(Парам01) Экспорт
	Ванесса.ПроверитьРавенство(Контекст.Тест,Истина,"В структуре Контекст есть значение тест");
КонецПроцедуры


//окончание текста модуля  