# language: ru

@IgnoreOn82Builds
@IgnoreOnOFBuilds
@IgnoreOnWeb


Функционал: Сделать паузу в указанное число секунд
	Как Разработчик
	Я Хочу чтобы чтобы у меня была возможность сделать паузу при выполнении шагов с заданным числом секунд
	Чтобы я мог дать нужным элементам управления отобразиться на экране


Сценарий: Пауза
	Когда Я делаю паузу 2 секунды
	# Когда Я делаю паузу 1 секунды
	И     Пауза 1

Сценарий: Выполнение паузы
    Когда Я запоминаю значение выражения "ТекущаяУниверсальнаяДатаВМиллисекундах()" в переменную "НачалоЗамера"
    И Я делаю паузу 2 секунды
    И выражение внутреннего языка "(ТекущаяУниверсальнаяДатаВМиллисекундах() - Контекст.НачалоЗамера) >= 2000" Истинно

Сценарий: Выполнение паузы #2
    Когда Я запоминаю значение выражения "ТекущаяУниверсальнаяДатаВМиллисекундах()" в переменную "НачалоЗамера"
    И Пауза 2
    И выражение внутреннего языка "(ТекущаяУниверсальнаяДатаВМиллисекундах() - Контекст.НачалоЗамера) >= 2000" Истинно