&НаКлиенте
Перем КонтекстЯдра;

&НаКлиенте
Перем АдресСервера;

// { Plugin interface

&НаКлиенте
Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	АдресСервера = "speller.yandex.net";
КонецПроцедуры

&НаКлиенте
Функция ОписаниеПлагина(ВозможныеТипыПлагинов) Экспорт
	Возврат ОписаниеПлагинаНаСервере(ВозможныеТипыПлагинов);
КонецФункции

&НаСервере
Функция ОписаниеПлагинаНаСервере(ВозможныеТипыПлагинов)
	Возврат ЭтотОбъектНаСервере().ОписаниеПлагина(ВозможныеТипыПлагинов);
КонецФункции
// } Plugin interface


#Область Обработка_результатов

&НаКлиенте
Функция РезультатПроверкиПравописания(Данные = Неопределено)
	
	Результат = ИнициализироватьСтрукутуруРезультатПроверки();
	
	Если Данные = Неопределено Тогда
		
		Возврат Результат;

	КонецЕсли;
	
	Результат.КодОшибки		= Данные["code"];
	Результат.Позиция		= Данные["pos"];
	Результат.Строка		= Данные["row"];
	Результат.Столбец		= Данные["col"];
	Результат.Длина 		= Данные["len"];
	Результат.ИсходноеСлово = Данные["word"];
	Подсказки 				= Новый Массив;
	
	Для Каждого Подсказка из Данные["s"] Цикл
		
		Подсказки.Добавить(Подсказка);
		
	КонецЦикла;
	
	Результат.Варианты = Подсказки;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ИнициализироватьСтрукутуруРезультатПроверки()
	
	Результат = Новый Структура;
	Результат.Вставить("КодОшибки");
	Результат.Вставить("Позиция");
	Результат.Вставить("Строка");
	Результат.Вставить("Столбец");
	Результат.Вставить("Длина");
	Результат.Вставить("ИсходноеСлово");
	Результат.Вставить("Варианты");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция РазобратьРезультатПроверки(ОтветСервиса, СловарьИсключений)
	
	Результат = Новый Массив;

	Для Каждого СтрокаДанных Из ОтветСервиса Цикл
		
		Ошибка = РезультатПроверкиПравописания(СтрокаДанных);
		Если СтрНайти(СловарьИсключений, Ошибка.ИсходноеСлово) = 0 Тогда
			
			Результат.Добавить(Ошибка);
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти



// { Helpers
&НаСервере
Функция ЭтотОбъектНаСервере()
	Возврат РеквизитФормыВЗначение("Объект");
КонецФункции
// } Helpers

&НаКлиенте
Процедура ЯндексНажатие(Элемент)
	ЗапуститьПриложение("http://api.yandex.ru/speller/");
КонецПроцедуры
