Перем ПутьКФайлуПолный Экспорт;// в эту переменную будет установлен правильный клиентский путь к текущему файлу

// { Plugin interface

// Вернуть описание плагина в виде структуры со спец.ключами
//
// Параметры:
//   ВозможныеТипыПлагинов - ФиксированнаяСтруктура -
//
//  Возвращаемое значение:
//   Структура - структура-результат
//
Функция ОписаниеПлагина(Знач ВозможныеТипыПлагинов) Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Тип", ВозможныеТипыПлагинов.ГенераторОтчета);
	Результат.Вставить("Идентификатор", Метаданные().Имя);
	Результат.Вставить("Представление", "");
	// Задействует АПИ для вывода результата отчета по мере исполнения тестов
	//Результат.Вставить("ПотоковыйВывод", Истина);

	ВызватьИсключение "Необходимо указать представление";

	Возврат Новый ФиксированнаяСтруктура(Результат);
КонецФункции

// Инициализация плагина
//
// Параметры:
//   КонтекстЯдраПараметр - объект браузера тестов -
//
Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
КонецПроцедуры

// } Plugin interface

// { Report generator interface

// Создать отчет, который будет в функцию "Показать"
//
// Параметры:
//   КонтекстЯдра - Объект - Объект браузера тестов
//   РезультатыТестирования - Структура, Соответствие -
//
//  Возвращаемое значение:
//   Любой - результат, который будет в функцию "Показать"
//
Функция СоздатьОтчет(КонтекстЯдра, РезультатыТестирования) Экспорт
	ЭтотОбъект.ТипыУзловДереваТестов = КонтекстЯдра.Плагин("ПостроительДереваТестов").ТипыУзловДереваТестов;
	ЭтотОбъект.СостоянияТестов = КонтекстЯдра.СостоянияТестов;
	ВызватьИсключение "Метод не реализован";
	Возврат Неопределено; //Возвращается рельный отчет
КонецФункции

#Если ТолстыйКлиентОбычноеПриложение Тогда
// Показать отчет о тестировании на клиенте
//
// Параметры:
//   Отчет - <Тип.Вид> - отчет, ранее возвращенный в функции СоздатьОтчет
//
Процедура Показать(Отчет) Экспорт
	ВызватьИсключение "Метод не реализован";
КонецПроцедуры
#КонецЕсли

// Сохранить результаты тестирования в файл
//
// Параметры:
//   Отчет - <Тип.Вид> - <описание параметра>
//   ПолныйПутьФайла - <Тип.Вид> - <описание параметра>
//
Процедура Экспортировать(Отчет, ПолныйПутьФайла) Экспорт
	ВызватьИсключение "Метод не реализован";
КонецПроцедуры

// Сохраняет результ теста сразу после его исполнения
// Используется если в описании установлено свойство "ПотоковыйВывод"
&НаКлиенте
Процедура ЗаписатьРезультатТеста(Знач КонтекстЯдра, Знач РезультатТеста, Знач ПолныйПутьФайла) Экспорт
	ВызватьИсключение "Метод не реализован";
КонецПроцедуры

// } Report generator interface
