
// { Plugin interface
&НаКлиенте
Функция ОписаниеПлагина(ВозможныеТипыПлагинов) Экспорт
	Возврат ОписаниеПлагинаНаСервере(ВозможныеТипыПлагинов);
КонецФункции

&НаСервере
Функция ОписаниеПлагинаНаСервере(ВозможныеТипыПлагинов)
	Возврат ЭтотОбъектНаСервере().ОписаниеПлагина(ВозможныеТипыПлагинов);
КонецФункции
// } Plugin interface

&НаКлиенте
Функция СоздатьКонтейнер(ИмяКонтейнера, ИконкаУзла = Неопределено) Экспорт
	Возврат СоздатьКонтейнерНаСервере(ИмяКонтейнера, ИконкаУзла);
КонецФункции

&НаСервере
Функция СоздатьКонтейнерНаСервере(ИмяКонтейнера, ИконкаУзла)
	Возврат ЭтотОбъектНаСервере().СоздатьКонтейнер(ИмяКонтейнера, ИконкаУзла);
КонецФункции

&НаКлиенте
Функция СоздатьЭлемент(Путь, ИмяМетода, Представление = "", ИконкаУзла = Неопределено) Экспорт
	Возврат СоздатьЭлементНаСервере(Путь, ИмяМетода, Представление, ИконкаУзла);
КонецФункции

&НаСервере
Функция СоздатьЭлементНаСервере(Путь, ИмяМетода, Представление, ИконкаУзла)
	Возврат ЭтотОбъектНаСервере().СоздатьЭлемент(Путь, ИмяМетода, Представление, ИконкаУзла);
КонецФункции

// { Helpers
&НаСервере
Функция ЭтотОбъектНаСервере()
	Возврат РеквизитФормыВЗначение("Объект");
КонецФункции
// } Helpers