Функция ПолучитьСписокИсключений_ДокументыПроведенные() Экспорт
	Результат = ПолучитьИсключения("ДокументыПроведенные");
	
	//Результат.Добавить("ЧтоОткрываем/ДокументОснование");

	Возврат Результат;
КонецФункции

Функция ПолучитьСписокИсключений_ДокументыНеПроведенные() Экспорт
	Результат = ПолучитьИсключения("ДокументыНеПроведенные");
	
	//Результат.Добавить("ЧтоОткрываем/ДокументОснование");
	
	Возврат Результат;
КонецФункции  

Функция ПолучитьИсключения(ВидИсключений)
			
	Если Настройки.Свойство("Исключения")
		И Настройки.Исключения.Свойство(ВидИсключений) Тогда
		Возврат Настройки.Исключения[ВидИсключений];
	КонецЕсли;
	
	Возврат Новый Массив;
	
КонецФункции