&НаКлиенте
Перем КонтекстЯдра;
&НаКлиенте
Перем Ожидаем;
&НаКлиенте
Перем Утверждения;
&НаКлиенте
Перем Настройки;

// { интерфейс тестирования

&НаКлиенте
Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра = КонтекстЯдраПараметр;
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	Настройки = КонтекстЯдра.Плагин("Настройки");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	
	НаборТестов.СтрогийПорядокВыполнения();
	
	НаборТестов.НачатьГруппу("Функции плагина Настройки");
	НаборТестов.Добавить("ТестДолжен_ПроверитьРаботуФункции_ПолучитьНастройки", , "Проверка работы функции ПолучитьНастройки");
	НаборТестов.Добавить("ТестДолжен_ПроверитьРаботуФункции_ЕстьНастройка", , "Проверка работы функции ЕстьНастройка");
	
КонецПроцедуры

// } интерфейс тестирования


// { блок юнит-тестов - сами тесты

&НаКлиенте
Процедура ТестДолжен_ПроверитьРаботуФункции_ПолучитьНастройки() Экспорт
	Перем НастройкиДанные;
	
	Настройки.ЗагрузитьНастройки();
	НастройкиДанные = Настройки.ПолучитьНастройки();
	Ожидаем.Что(НастройкиДанные, "Ожидали, что пустая структура, но это не так!")
		.ИмеетТип("ФиксированнаяСтруктура")
		.ИмеетДлину(0);
	
	Настройки.ЗагрузитьНастройки(НастройкиДанныеКакСтруктура());
	НастройкиДанные = Настройки.ПолучитьНастройки();
	Ожидаем.Что(НастройкиДанные, "Ожидали, что структура с данными, но это не так!")
		.ИмеетТип("ФиксированнаяСтруктура")
		.НЕ_().ИмеетДлину(0);
	
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ПроверитьРаботуФункции_ЕстьНастройка() Экспорт
	Перем бЕстьНастройка, ЗначениеНастройки;
	
	Настройки.ЗагрузитьНастройки(НастройкиДанныеКакСтруктура());
	
	ЗначениеНастройки = Неопределено;
	бЕстьНастройка = Настройки.ЕстьНастройка("НесуществующийКлюч", ЗначениеНастройки);
	Ожидаем.Что(бЕстьНастройка, "Ожидали, что для несуществующего ключа настроек не будет найдено настроек, но это не так!")
		.ЭтоЛожь();
	
	ЗначениеНастройки = Неопределено;
	бЕстьНастройка = Настройки.ЕстьНастройка("Ключ21", ЗначениеНастройки);
	Ожидаем.Что(бЕстьНастройка, "Ожидали, что для вложенного ключа без указания полного пути не будет найдено настроек, но это не так!")
		.ЭтоЛожь();
	
	ЗначениеНастройки = Неопределено;
	бЕстьНастройка = Настройки.ЕстьНастройка("Ключ1", ЗначениеНастройки);
	Ожидаем.Что(бЕстьНастройка, "Ожидали, что для ключа Ключ1 будет найдена настройка, но это не так!")
		.ЭтоИстина();
	Ожидаем.Что(ЗначениеНастройки, "Ожидали, что для ключа Ключ1 значение настройки число 1, но это не так")
		.ИмеетТип("Число")
		.Равно(1);
	
	ЗначениеНастройки = Неопределено;
	бЕстьНастройка = Настройки.ЕстьНастройка("Ключ2.Ключ21", ЗначениеНастройки);
	Ожидаем.Что(бЕстьНастройка, "Ожидали, что для пути Ключ2.Ключ21 будет найдена настройка, но это не так!")
		.ЭтоИстина();
	Ожидаем.Что(ЗначениеНастройки, "Ожидали, что для пути Ключ2.Ключ21 значение настройки число 21, но это не так")
		.ИмеетТип("Число")
		.Равно(21);
	
	ЗначениеНастройки = Неопределено;
	бЕстьНастройка = Настройки.ЕстьНастройка("Ключ3.Ключ32", ЗначениеНастройки);
	Ожидаем.Что(бЕстьНастройка, "Ожидали, что для пути Ключ3.Ключ32 будет найдена настройка, но это не так!")
		.ЭтоИстина();
	Ожидаем.Что(ЗначениеНастройки, "Ожидали, что для пути Ключ3.Ключ32 значение настройки непустая Структура настроек, но это не так")
		.ИмеетТип("Структура")
		.НЕ_().ИмеетДлину(0);
	
	ЗначениеНастройки = Неопределено;
	бЕстьНастройка = Настройки.ЕстьНастройка("Ключ3.Ключ32.Ключ321", ЗначениеНастройки);
	Ожидаем.Что(бЕстьНастройка, "Ожидали, что для пути Ключ3.Ключ32.Ключ321 будет найдена настройка, но это не так!")
		.ЭтоИстина();
	Ожидаем.Что(ЗначениеНастройки, "Ожидали, что для пути Ключ3.Ключ32.Ключ321 значение настройки число 321, но это не так")
		.ИмеетТип("Число")
		.Равно(321);
	
КонецПроцедуры

// } блок юнит-тестов - сами тесты


// { Служебные методы

&НаКлиенте
Функция НастройкиДанныеКакСтруктура()
	Перем стНастройкиДанные;
	
	стНастройкиДанные = Новый Структура();
	стНастройкиДанные.Вставить("Ключ1", 1);
	стНастройкиДанные.Вставить("Ключ2", Новый Структура("Ключ21, Ключ22", 21, 22));
	стНастройкиДанные.Вставить("Ключ3", Новый Структура("Ключ31, Ключ32", 31, Новый Структура("Ключ321", 321)));
	
	Возврат стНастройкиДанные;
КонецФункции

// } Служебные методы