&НаКлиенте
Перем КонтекстЯдра;
&НаКлиенте
Перем Ожидаем;
&НаКлиенте
Перем Утверждения;
&НаКлиенте
Перем Настройки;

// { интерфейс тестирования

&НаКлиенте
Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра = КонтекстЯдраПараметр;
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	Настройки = КонтекстЯдра.Плагин("Настройки");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	
	НаборТестов.СтрогийПорядокВыполнения();
	
	НаборТестов.НачатьГруппу("Функции плагина Настройки");
	НаборТестов.Добавить("ТестДолжен_ПроверитьРаботуФункции_ПолучитьНастройки", , "Проверка работы функции ПолучитьНастройки");
	НаборТестов.Добавить("ТестДолжен_ПроверитьРаботуФункции_ДобавитьНастройку", , "Проверка работы функции ДобавитьНастройку");
	НаборТестов.Добавить("ТестДолжен_ПроверитьРаботуФункции_ДобавитьНастройки", , "Проверка работы функции ДобавитьНастройки");
	
КонецПроцедуры

// } интерфейс тестирования


// { блок юнит-тестов - сами тесты

// Не проходной тест. Должен упасть

&НаКлиенте
Процедура ТестДолжен_ПроверитьРаботуФункции_ПолучитьНастройки() Экспорт
	
	Настройки.Обновить();
	
	НастройкиДанные = Настройки.ПолучитьНастройки();
	Ожидаем.Что(НастройкиДанные, "Ожидали, что пустая структура, но это не так!")
		.ИмеетТип("ФиксированнаяСтруктура")
		.ИмеетДлину(0);
	
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ПроверитьРаботуФункции_ДобавитьНастройку() Экспорт
	
	Настройки.Обновить();
	
	Настройки.ДобавитьНастройку("Ключ99", 99);
	НастройкиДанные = Настройки.ПолучитьНастройки();
	Ожидаем.Что(НастройкиДанные, "Ожидали, что после добавления в настройках один элемент, но это не так.")
		.ИмеетТип("ФиксированнаяСтруктура")
		.ИмеетДлину(1);
		
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ПроверитьРаботуФункции_ДобавитьНастройки() Экспорт
	
	Настройки.Обновить();
	
	НастройкиДанные = Настройки.ПолучитьНастройки();
	Ожидаем.Что(НастройкиДанные, "Ожидали, что после обновления настроек они не содержат элементов, но это не так.")
		.ИмеетТип("ФиксированнаяСтруктура")
		.ИмеетДлину(0);
	
	Настройки.ДобавитьНастройки(НастройкиДанныеКакСтруктура());
	НастройкиДанные = Настройки.ПолучитьНастройки();
	Ожидаем.Что(НастройкиДанные, "Ожидали, что после добавления в настройках три элемента, но это не так.")
		.ИмеетТип("ФиксированнаяСтруктура")
		.ИмеетДлину(3);
		
	Настройки.ДобавитьНастройки(Новый Структура());
	НастройкиДанные = Настройки.ПолучитьНастройки();
	Ожидаем.Что(НастройкиДанные, "Ожидали, что после добавления пустых настроек текущие настройки не изменятся, но это не так.")
		.ИмеетТип("ФиксированнаяСтруктура")
		.ИмеетДлину(3);
		
	Настройки.ДобавитьНастройки("abc");
	НастройкиДанные = Настройки.ПолучитьНастройки();
	Ожидаем.Что(НастройкиДанные, "Ожидали, что после добавления некорректных настроек текущие настройки не изменятся, но это не так.")
		.ИмеетТип("ФиксированнаяСтруктура")
		.ИмеетДлину(3);
		
КонецПроцедуры

// } блок юнит-тестов - сами тесты


// { Служебные методы

&НаКлиенте
Функция НастройкиДанныеКакСтруктура()
	Перем стНастройкиДанные;
	
	стНастройкиДанные = Новый Структура();
	стНастройкиДанные.Вставить("Ключ1", 1);
	стНастройкиДанные.Вставить("Ключ2", Новый Структура("Ключ21, Ключ22", 21, 22));
	стНастройкиДанные.Вставить("Ключ3", Новый Структура("Ключ31, Ключ32", 31, Новый Структура("Ключ321", 321)));
	
	Возврат стНастройкиДанные;
КонецФункции

// } Служебные методы