#language: ru

@Ignore

Функционал: Получение и работа с письмами из Fake-SMTP-Server

Как Тестировщик
Я хочу проверить что письма удачно доставлены
Чтобы быть уверенным что все работает корректно

Сценарий: Установка настроек фейкового ящика
    Допустим порт ящика '1080'
    Допустим адрес ящика '0.0.0.0'
    Допустим период опроса почты '1' сек
    Тогда очищаем ящик от писем

Сценарий: Проверка наличия писем в ящике
	Тогда в ящике есть письма
    #ищем письма по времени +/- период опроса от текущей даты
    Тогда в ящике есть новые письма

Сценарий: Проверка писем в ящике
    Тогда в ящике есть письма с темой "Тема"
    Тогда в ящике есть письма с текстом "Текст"
    Тогда в ящике есть письма от "Отправитель"
    Тогда в ящике есть письма для "Получатель"
    # вариант "текучих выражений"
    И темой письма "Тема"
    И текстом письма "Текст"
    И письма от "Отправитель"
    И письма для "Получатель"