#Область ОписаниеПеременных

Перем КлючМетода;
Перем ВозвращаемоеЗначение;

#КонецОбласти

#Область ПрограммныйИнтерфейс

#Область ТекучийИнтерфейс

// Установить ключ метода для подмены
//
// Параметры:
//  КлючПодмены	 - Строка	 - ключ метода для подмены.
// 
// Возвращаемое значение:
//   Обработка.МокТестирования - этот объект для текучего интерфейса
//
Функция Метод(Знач КлючПодмены) Экспорт
	
	КлючМетода = КлючПодмены;

	Возврат ЭтотОбъект;
	
КонецФункции

// Функция - Должен возвращать
// 	ВАЖНО - значение должно уметь сохраняться в хранилище настроек
//
// Параметры:
//  Значение - Произвольный	 - ВАЖНО - значение должно уметь сохраняться в хранилище настроек
// 
// Возвращаемое значение:
//   Обработка.МокТестирования - этот объект для текучего интерфейса
//
Функция ДолженВозвращать(Знач Значение) Экспорт
	
	МокТестирование.УстановитьПодменуВозвращаемогоЗначения(КлючМетода, Значение);
	
	Возврат ЭтотОбъект;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
