//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

// контекст фреймворка Vanessa-ADD
Перем Ванесса;

// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;

	ВсеТесты = Новый Массив;

	// описание шагов
	//пример вызова Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВТестируемомЭкземпляреШагСНомеромИмеетСтатусFailed(Парам01)","ВТестируемомЭкземпляреШагСНомеромИмеетСтатусFailed","Тогда в тестируемом экземпляре шаг с номером 3 имеет статус Failed");

	Возврат ВсеТесты;
КонецФункции

&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	Возврат ПолучитьМакет(ИмяМакета);
КонецФункции

// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции

///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	Попытка
	    ОткрытаяФормаVanessaADD = Контекст.ОткрытаяФормаVanessaADD;
		ОткрытаяФормаVanessaADD.Закрыть();
	Исключение

	КонецПопытки;

КонецПроцедуры

///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

//Тогда в тестируемом экземпляре шаг с номером 3 имеет статус Failed
//@ВТестируемомЭкземпляреШагСНомеромИмеетСтатусFailed(Парам01)
Процедура ВТестируемомЭкземпляреШагСНомеромИмеетСтатусFailed(НомерШага) Экспорт
	Дерево          = Контекст.ОткрытаяФормаVanessaADD.ДеревоТестов;
	СтрокаКаталог  = Дерево.Строки[0];
	СтрокаФичи      = СтрокаКаталог.Строки[0];
	СтрокаСценария  = СтрокаФичи.Строки[0];

	Если СтрокаСценария.Статус <> "Failed" Тогда
		ВызватьИсключение "Сценарий должен иметь статус ""Failed"", а получился " + СтрокаСценария.Статус;
	КонецЕсли;

	СтрокаШага = СтрокаСценария.Строки[0];
	Если СтрокаШага.Статус <> "Failed" Тогда
		ВызватьИсключение "Шаг должен иметь статус ""Failed"", а получился " + СтрокаШага.Статус;
	КонецЕсли;
КонецПроцедуры

//окончание текста модуля