Перем КонтекстЯдра;
Перем Ожидаем;
Перем Утверждения;
Перем ГенераторТестовыхДанных;
Перем ЗапросыИзБД;
Перем УтвержденияПроверкаТаблиц;

//{ основные процедуры для юнит-тестирования xUnitFor1C

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
	ГенераторТестовыхДанных = КонтекстЯдра.Плагин("СериализаторMXL");
	ЗапросыИзБД = КонтекстЯдра.Плагин("ЗапросыИзБД");
	УтвержденияПроверкаТаблиц = КонтекстЯдра.Плагин("УтвержденияПроверкаТаблиц");
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	//НаборТестов.НачатьГруппу("Сценарный тест", Истина);
	//НаборТестов.Добавить("ПараметрическийТест", НаборТестов.ПараметрыТеста(5, 7), "Тест должен показать использование представления теста");
		//Тест = НаборТестов.Добавить("ПараметрическийТест2");
		//Тест.Параметры.Добавить(12);
	НаборТестов.Добавить("ТестДолжен_ЧтоТоСделать");
КонецПроцедуры
//}

//{ блок юнит-тестов - сами тесты

//Процедура ПередЗапускомТеста() Экспорт
//	НачатьТранзакцию();	
//КонецПроцедуры

//Процедура ПослеЗапускаТеста() Экспорт
//	Если ТранзакцияАктивна() Тогда
//		ОтменитьТранзакцию();
//	КонецЕсли; 
//КонецПроцедуры

Процедура ТестДолжен_ЧтоТоСделать() Экспорт
	Сообщить("Сообщение из теста ТестДолжен_ЧтоТоСделать");
КонецПроцедуры

//} 
