//начало текста модуля

///////////////////////////////////////////////////
//Служебная часть
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-ADD
Перем Ванесса;

&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;

&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-ADD.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;

	ВсеТесты = Новый Массив;

	// описание шагов
	//пример вызова Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯНажимаюНаГиперссылкуДляПоля(Парам01,Парам02)","ЯНажимаюНаГиперссылкуДляПоля","И я нажимаю на гиперссылку 'Гиперссылка2' для поля ""Форматированная строка""","Позволяет нажать гиперссылку для форматированной строки","UI.Формы.Гиперссылки");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯНажимаюНаГиперссылкуДляПоляСИменем(Парам01,Парам02)","ЯНажимаюНаГиперссылкуДляПоляСИменем","И я нажимаю на гиперссылку 'Гиперссылка1' для поля с именем ""ФорматированнаяСтрока""","Позволяет нажать гиперссылку для форматированной строки","UI.Формы.Гиперссылки");

	Возврат ВсеТесты;
КонецФункции

&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции

&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции

///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт

КонецПроцедуры

///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//И я нажимаю на гиперссылку 'Гиперссылка2' для поля "Форматированная строка"
//@ЯНажимаюНаГиперссылкуДляПоля(Парам01,Парам02)
Процедура ЯНажимаюНаГиперссылкуДляПоля(Гиперссылка, ИмяЭлемента, ИскатьПоИмени = Ложь) Экспорт

	Попытка

		ЭлементФормы = Ванесса.НайтиРеквизитОткрытойФормыПоЗаголовку(ИмяЭлемента, ИскатьПоИмени, Истина);
		Попытка
			ЭлементФормы.НажатьНаГиперссылкуВФорматированнойСтроке(Гиперссылка);
		Исключение
			ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("У поля <%1> неудачное нажатие на гиперссылку <%2>.");
			ВызватьИсключение Ванесса.СтрШаблон_(ТекстСообщения, ИмяЭлемента, Гиперссылка);
		КонецПопытки;

	Исключение
		ВызватьИсключение ОписаниеОшибки();
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
//И я нажимаю на гиперссылку 'Гиперссылка1' для поля с именем "ФорматированнаяСтрока"
//@ЯНажимаюНаГиперссылкуДляПоляСИменем(Парам01,Парам02)
Процедура ЯНажимаюНаГиперссылкуДляПоляСИменем(Гиперссылка, ИмяЭлемента) Экспорт
	ЯНажимаюНаГиперссылкуДляПоля(Гиперссылка, ИмяЭлемента, Истина);
КонецПроцедуры

//окончание текста модуля
